# VertexStreamPosition Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
VertexStreamPosition Methods
VertexStreamPosition Class See Also
---
The VertexStreamPosition type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AddVertex | Inserts a VertexStreamPosition into the stream and associated buffer. |
| AddVertices | Inserts multiple VertexStreamPosition instances into the stream and associated buffer. |
| Dispose | (Inherited from VertexStream.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
VertexStreamPosition Class
Autodesk.Revit.DB.DirectContext3D Namespace